from enum import Enum

VALIDYAO = [0, 1]

YINYAO = [0, 6, 3, 5]
YANGYAO = [7, 4, 2, 1]

BIANYAO = [0, 7]

BAGUA = ['坤', '艮', '坎', '巽', '震', '离', '兑', '乾']

LIUSHISIGUA = [
    ['坤', '剥', '比', '观', '豫', '晋', '萃', '否'],
    ['谦', '艮', '蹇', '渐', '小过', '旅', '咸', '遁'],
    ['师', '蒙', '坎', '涣', '解', '未济', '困', '讼'],
    ['升', '蛊', '井', '巽', '恒', '鼎', '大过', '姤'],
    ['复', '颐', '屯', '益', '震', '噬嗑', '随', '无妄'],
    ['明夷', '贲', '既济', '家人', '丰', '离', '革', '同人'],
    ['临', '损', '节', '中孚', '归妹', '睽', '兑', '履'],
    ['泰', '大畜', '需', '小畜', '大壮', '大有', '夬', '乾'],
]

LIUSHISIGUAVALUE = {
    '坤':0,
    '剥':1,
    '比':2,
    '观':3,
    '豫':4,
    '晋':5,
    '萃':6,
    '否':7,
    '谦':8,
    '艮':9,
    '蹇':10,
    '渐':11,
    '小过':12,
    '旅':13,
    '咸':14,
    '遁':15,
    '师':16,
    '蒙':17,
    '坎':18,
    '涣':19,
    '解':20,
    '未济':21,
    '困':22,
    '讼':23,
    '升':24,
    '蛊':25,
    '井':26,
    '巽':27,
    '恒':28,
    '鼎':29,
    '大过':30,
    '姤':31,
    '复':32,
    '颐':33,
    '屯':34,
    '益':35,
    '震':36,
    '噬嗑':37,
    '随':38,
    '无妄':39,
    '明夷':40,
    '贲':41,
    '既济':42,
    '家人':43,
    '丰':44,
    '离':45,
    '革':46,
    '同人':47,
    '临':48,
    '损':49,
    '节':50,
    '中孚':51,
    '归妹':52,
    '睽':53,
    '兑':54,
    '履':55,
    '泰':56,
    '大畜':57,
    '需':58,
    '小畜':59,
    '大壮':60,
    '大有':61,
    '夬':62,
    '乾':63,
}

XIAGUANAJIA = {
    "乾": ["甲子", "甲寅", "甲辰"], 
    "坤": ["乙未", "乙巳", "乙卯"], 
    "艮": ["丙辰", "丙午", "丙申"], 
    "兑": ["丁巳", "丁卯", "丁丑"], 
    "坎": ["戊寅", "戊辰", "戊午"], 
    "离": ["己卯", "己丑", "己亥"], 
    "震": ["庚子", "庚寅", "庚辰"], 
    "巽": ["辛丑", "辛亥", "辛酉"], 
}

SHANGGUANAJIA = {
    "乾": ["壬午", "壬申", "壬戌"], 
    "坤": ["癸丑", "癸亥", "癸酉"], 
    "艮": ["丙戌", "丙子", "丙寅"], 
    "兑": ["丁亥", "丁酉", "丁未"], 
    "坎": ["戊申", "戊戌", "戊子"], 
    "离": ["己酉", "己未", "己巳"], 
    "震": ["庚午", "庚申", "庚戌"], 
    "巽": ["辛未", "辛巳", "辛卯"], 
}

class WUXING(Enum):
    木 = 0
    火 = 1
    土 = 2
    金 = 3
    水 = 4

BAGONGWUXING = {
    '坤': WUXING.土, 
    '艮': WUXING.土, 
    '坎': WUXING.水, 
    '巽': WUXING.木, 
    '震': WUXING.木, 
    '离': WUXING.火, 
    '兑': WUXING.金, 
    '乾': WUXING.金
    }

BAGONG = {
    '乾': ["乾", "姤", "遁", "否", "观", "剥", "晋", "大有"], 
    '震': ["震", "豫", "解", "恒", "升", "井", "大过", "随"], 
    '坎': ["坎", "节", "屯", "既济", "革", "丰", "明夷", "师"],
    '艮': ["艮", "贲", "大畜", "损", "睽", "履", "中孚", "渐"],  
    '坤': ["坤", "复", "临", "泰", "大壮", "夬", "需", "比"],  
    '巽': ["巽", "小畜", "家人", "益", "无妄", "噬嗑", "颐", "蛊"], 
    '离': ["离", "旅", "鼎", "未济", "蒙", "涣", "讼", "同人"], 
    '兑': ["兑", "困", "萃", "咸", "蹇", "谦", "小过", "归妹"],  
}

LIUSHIZIGUAFULLNAME = {
    "乾": "乾为天", 
    "姤": "天风姤", 
    "遁": "天山遁", 
    "否": "天地否", 
    "观": "风地观", 
    "剥": "山地剥", 
    "晋": "火地晋", 
    "大有": "火天大有", 
    "震": "震为雷", 
    "豫": "雷地豫", 
    "解": "雷水解", 
    "恒": "雷风恒", 
    "升": "地风升", 
    "井": "水风井", 
    "大过": "泽风大过", 
    "随": "泽雷随", 
    "坎": "坎为水", 
    "节": "水泽节", 
    "屯": "水雷屯", 
    "既济": "水火既济", 
    "革": "泽火革", 
    "丰": "雷火丰", 
    "明夷": "地火明夷", 
    "师": "地水师", 
    "艮": "艮为山", 
    "贲": "山火贲", 
    "大畜": "山天大畜", 
    "损": "山泽损", 
    "睽": "火泽睽", 
    "履": "天泽履", 
    "中孚": "风泽中孚", 
    "渐": "风山渐", 
    "坤": "坤为地", 
    "复": "地雷复", 
    "临": "地泽临", 
    "泰": "地天泰", 
    "大壮": "雷天大壮", 
    "夬": "泽天夬", 
    "需": "水天需", 
    "比": "水地比", 
    "巽": "巽为风", 
    "小畜": "风天小畜", 
    "家人": "风火家人", 
    "益": "风雷益", 
    "无妄": "天雷无妄", 
    "噬嗑": "火雷噬嗑", 
    "颐": "山雷颐", 
    "蛊": "山风蛊", 
    "离": "离为火", 
    "旅": "火山旅", 
    "鼎": "火风鼎", 
    "未济": "火水未济", 
    "蒙": "山水蒙", 
    "涣": "风水涣", 
    "讼": "天水讼", 
    "同人": "天火同人", 
    "兑": "兑为泽", 
    "困": "泽水困", 
    "萃": "泽地萃", 
    "咸": "泽山咸", 
    "蹇": "水山蹇", 
    "谦": "地山谦", 
    "小过": "雷山小过", 
    "归妹": "雷泽归妹"
}

SHIYAOIDX = [5, 0, 1, 2, 3, 4, 3, 2]

DIZHIWUXING = {
    "子":WUXING.水,
    "丑":WUXING.土,
    "寅":WUXING.木,
    "卯":WUXING.木,
    "辰":WUXING.土,
    "巳":WUXING.火,
    "午":WUXING.火,
    "未":WUXING.土,
    "申":WUXING.金,
    "酉":WUXING.金,
    "戌":WUXING.土,
    "亥":WUXING.水
}

LIUQINLIST = ["兄弟", "子孙", "妻财", "官鬼", "父母"]

LIUSHENDICT = {
    "甲": ["青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"], 
    "乙": ["青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"], 
    "丙": ["朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"], 
    "丁": ["朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"], 
    "戊": ["勾陈", "螣蛇", "白虎", "玄武", "青龙", "朱雀"], 
    "己": ["螣蛇", "白虎", "玄武", "青龙", "朱雀", "勾陈"], 
    "庚": ["白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"], 
    "辛": ["白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"], 
    "壬": ["玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"], 
    "癸": ["玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"],  
}

GONGWEINAME = ["本宫", "一世", "二世", "三世", "四世", "五世", "游魂", "归魂"]

TIANGAN = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]

DIZHI = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

XUNKONGDICT = {
    '甲子': ['戌', '亥'], '乙丑': ['戌', '亥'], '丙寅': ['戌', '亥'], '丁卯': ['戌', '亥'], '戊辰': ['戌', '亥'], 
    '己巳': ['戌', '亥'], '庚午': ['戌', '亥'], '辛未': ['戌', '亥'], '壬申': ['戌', '亥'], '癸酉': ['戌', '亥'], 
    '甲戌': ['申', '酉'], '乙亥': ['申', '酉'], '丙子': ['申', '酉'], '丁丑': ['申', '酉'], '戊寅': ['申', '酉'], 
    '己卯': ['申', '酉'], '庚辰': ['申', '酉'], '辛巳': ['申', '酉'], '壬午': ['申', '酉'], '癸未': ['申', '酉'], 
    '甲申': ['午', '未'], '乙酉': ['午', '未'], '丙戌': ['午', '未'], '丁亥': ['午', '未'], '戊子': ['午', '未'], 
    '己丑': ['午', '未'], '庚寅': ['午', '未'], '辛卯': ['午', '未'], '壬辰': ['午', '未'], '癸巳': ['午', '未'], 
    '甲午': ['辰', '巳'], '乙未': ['辰', '巳'], '丙申': ['辰', '巳'], '丁酉': ['辰', '巳'], '戊戌': ['辰', '巳'], 
    '己亥': ['辰', '巳'], '庚子': ['辰', '巳'], '辛丑': ['辰', '巳'], '壬寅': ['辰', '巳'], '癸卯': ['辰', '巳'], 
    '甲辰': ['寅', '卯'], '乙巳': ['寅', '卯'], '丙午': ['寅', '卯'], '丁未': ['寅', '卯'], '戊申': ['寅', '卯'], 
    '己酉': ['寅', '卯'], '庚戌': ['寅', '卯'], '辛亥': ['寅', '卯'], '壬子': ['寅', '卯'], '癸丑': ['寅', '卯'], 
    '甲寅': ['子', '丑'], '乙卯': ['子', '丑'], '丙辰': ['子', '丑'], '丁巳': ['子', '丑'], '戊午': ['子', '丑'], 
    '己未': ['子', '丑'], '庚申': ['子', '丑'], '辛酉': ['子', '丑'], '壬戌': ['子', '丑'], '癸亥': ['子', '丑']
    }

LIUSHISIGUAINFO = {
    '坤': {'wuxing': WUXING.土, 'shiyao': 5, 'yingyao': 2, 'fullname': '坤为地', 'najia': ['乙未', '乙巳', '乙卯', '癸丑', '癸亥', '癸酉'], 'gong': '坤', 'gongwei': '本宫'}, 
    '剥': {'wuxing': WUXING.金, 'shiyao': 4, 'yingyao': 1, 'fullname': '山地剥', 'najia': ['乙未', '乙巳', '乙卯', '丙戌', '丙子', '丙寅'], 'gong': '乾', 'gongwei': '五世'}, 
    '比': {'wuxing': WUXING.土, 'shiyao': 2, 'yingyao': 5, 'fullname': '水地比', 'najia': ['乙未', '乙巳', '乙卯', '戊申', '戊戌', '戊子'], 'gong': '坤', 'gongwei': '归魂'}, 
    '观': {'wuxing': WUXING.金, 'shiyao': 3, 'yingyao': 0, 'fullname': '风地观', 'najia': ['乙未', '乙巳', '乙卯', '辛未', '辛巳', '辛卯'], 'gong': '乾', 'gongwei': '四世'}, 
    '豫': {'wuxing': WUXING.木, 'shiyao': 0, 'yingyao': 3, 'fullname': '雷地豫', 'najia': ['乙未', '乙巳', '乙卯', '庚午', '庚申', '庚戌'], 'gong': '震', 'gongwei': '一世'}, 
    '晋': {'wuxing': WUXING.金, 'shiyao': 3, 'yingyao': 0, 'fullname': '火地晋', 'najia': ['乙未', '乙巳', '乙卯', '己酉', '己未', '己巳'], 'gong': '乾', 'gongwei': '游魂'}, 
    '萃': {'wuxing': WUXING.金, 'shiyao': 1, 'yingyao': 4, 'fullname': '泽地萃', 'najia': ['乙未', '乙巳', '乙卯', '丁亥', '丁酉', '丁未'], 'gong': '兑', 'gongwei': '二世'}, 
    '否': {'wuxing': WUXING.金, 'shiyao': 2, 'yingyao': 5, 'fullname': '天地否', 'najia': ['乙未', '乙巳', '乙卯', '壬午', '壬申', '壬戌'], 'gong': '乾', 'gongwei': '三世'}, 
    '谦': {'wuxing': WUXING.金, 'shiyao': 4, 'yingyao': 1, 'fullname': '地山谦', 'najia': ['丙辰', '丙午', '丙申', '癸丑', '癸亥', '癸酉'], 'gong': '兑', 'gongwei': '五世'}, 
    '艮': {'wuxing': WUXING.土, 'shiyao': 5, 'yingyao': 2, 'fullname': '艮为山', 'najia': ['丙辰', '丙午', '丙申', '丙戌', '丙子', '丙寅'], 'gong': '艮', 'gongwei': '本宫'}, 
    '蹇': {'wuxing': WUXING.金, 'shiyao': 3, 'yingyao': 0, 'fullname': '水山蹇', 'najia': ['丙辰', '丙午', '丙申', '戊申', '戊戌', '戊子'], 'gong': '兑', 'gongwei': '四世'}, 
    '渐': {'wuxing': WUXING.土, 'shiyao': 2, 'yingyao': 5, 'fullname': '风山渐', 'najia': ['丙辰', '丙午', '丙申', '辛未', '辛巳', '辛卯'], 'gong': '艮', 'gongwei': '归魂'}, 
    '小过': {'wuxing': WUXING.金, 'shiyao': 3, 'yingyao': 0, 'fullname': '雷山小过', 'najia': ['丙辰', '丙午', '丙申', '庚午', '庚申', '庚戌'], 'gong': '兑', 'gongwei': '游魂'}, 
    '旅': {'wuxing': WUXING.火, 'shiyao': 0, 'yingyao': 3, 'fullname': '火山旅', 'najia': ['丙辰', '丙午', '丙申', '己酉', '己未', '己巳'], 'gong': '离', 'gongwei': '一世'}, 
    '咸': {'wuxing': WUXING.金, 'shiyao': 2, 'yingyao': 5, 'fullname': '泽山咸', 'najia': ['丙辰', '丙午', '丙申', '丁亥', '丁酉', '丁未'], 'gong': '兑', 'gongwei': '三世'}, 
    '遁': {'wuxing': WUXING.金, 'shiyao': 1, 'yingyao': 4, 'fullname': '天山遁', 'najia': ['丙辰', '丙午', '丙申', '壬午', '壬申', '壬戌'], 'gong': '乾', 'gongwei': '二世'}, 
    '师': {'wuxing': WUXING.水, 'shiyao': 2, 'yingyao': 5, 'fullname': '地水师', 'najia': ['戊寅', '戊辰', '戊午', '癸丑', '癸亥', '癸酉'], 'gong': '坎', 'gongwei': '归魂'}, 
    '蒙': {'wuxing': WUXING.火, 'shiyao': 3, 'yingyao': 0, 'fullname': '山水蒙', 'najia': ['戊寅', '戊辰', '戊午', '丙戌', '丙子', '丙寅'], 'gong': '离', 'gongwei': '四世'}, 
    '坎': {'wuxing': WUXING.水, 'shiyao': 5, 'yingyao': 2, 'fullname': '坎为水', 'najia': ['戊寅', '戊辰', '戊午', '戊申', '戊戌', '戊子'], 'gong': '坎', 'gongwei': '本宫'}, 
    '涣': {'wuxing': WUXING.火, 'shiyao': 4, 'yingyao': 1, 'fullname': '风水涣', 'najia': ['戊寅', '戊辰', '戊午', '辛未', '辛巳', '辛卯'], 'gong': '离', 'gongwei': '五世'}, 
    '解': {'wuxing': WUXING.木, 'shiyao': 1, 'yingyao': 4, 'fullname': '雷水解', 'najia': ['戊寅', '戊辰', '戊午', '庚午', '庚申', '庚戌'], 'gong': '震', 'gongwei': '二世'}, 
    '未济': {'wuxing': WUXING.火, 'shiyao': 2, 'yingyao': 5, 'fullname': '火水未济', 'najia': ['戊寅', '戊辰', '戊午', '己酉', '己未', '己巳'], 'gong': '离', 'gongwei': '三世'}, 
    '困': {'wuxing': WUXING.金, 'shiyao': 0, 'yingyao': 3, 'fullname': '泽水困', 'najia': ['戊寅', '戊辰', '戊午', '丁亥', '丁酉', '丁未'], 'gong': '兑', 'gongwei': '一世'}, 
    '讼': {'wuxing': WUXING.火, 'shiyao': 3, 'yingyao': 0, 'fullname': '天水讼', 'najia': ['戊寅', '戊辰', '戊午', '壬午', '壬申', '壬戌'], 'gong': '离', 'gongwei': '游魂'}, 
    '升': {'wuxing': WUXING.木, 'shiyao': 3, 'yingyao': 0, 'fullname': '地风升', 'najia': ['辛丑', '辛亥', '辛酉', '癸丑', '癸亥', '癸酉'], 'gong': '震', 'gongwei': '四世'}, 
    '蛊': {'wuxing': WUXING.木, 'shiyao': 2, 'yingyao': 5, 'fullname': '山风蛊', 'najia': ['辛丑', '辛亥', '辛酉', '丙戌', '丙子', '丙寅'], 'gong': '巽', 'gongwei': '归魂'}, 
    '井': {'wuxing': WUXING.木, 'shiyao': 4, 'yingyao': 1, 'fullname': '水风井', 'najia': ['辛丑', '辛亥', '辛酉', '戊申', '戊戌', '戊子'], 'gong': '震', 'gongwei': '五世'}, 
    '巽': {'wuxing': WUXING.木, 'shiyao': 5, 'yingyao': 2, 'fullname': '巽为风', 'najia': ['辛丑', '辛亥', '辛酉', '辛未', '辛巳', '辛卯'], 'gong': '巽', 'gongwei': '本宫'}, 
    '恒': {'wuxing': WUXING.木, 'shiyao': 2, 'yingyao': 5, 'fullname': '雷风恒', 'najia': ['辛丑', '辛亥', '辛酉', '庚午', '庚申', '庚戌'], 'gong': '震', 'gongwei': '三世'}, 
    '鼎': {'wuxing': WUXING.火, 'shiyao': 1, 'yingyao': 4, 'fullname': '火风鼎', 'najia': ['辛丑', '辛亥', '辛酉', '己酉', '己未', '己巳'], 'gong': '离', 'gongwei': '二世'}, 
    '大过': {'wuxing': WUXING.木, 'shiyao': 3, 'yingyao': 0, 'fullname': '泽风大过', 'najia': ['辛丑', '辛亥', '辛酉', '丁亥', '丁酉', '丁未'], 'gong': '震', 'gongwei': '游魂'}, 
    '姤': {'wuxing': WUXING.金, 'shiyao': 0, 'yingyao': 3, 'fullname': '天风姤', 'najia': ['辛丑', '辛亥', '辛酉', '壬午', '壬申', '壬戌'], 'gong': '乾', 'gongwei': '一世'}, 
    '复': {'wuxing': WUXING.土, 'shiyao': 0, 'yingyao': 3, 'fullname': '地雷复', 'najia': ['庚子', '庚寅', '庚辰', '癸丑', '癸亥', '癸酉'], 'gong': '坤', 'gongwei': '一世'}, 
    '颐': {'wuxing': WUXING.木, 'shiyao': 3, 'yingyao': 0, 'fullname': '山雷颐', 'najia': ['庚子', '庚寅', '庚辰', '丙戌', '丙子', '丙寅'], 'gong': '巽', 'gongwei': '游魂'}, 
    '屯': {'wuxing': WUXING.水, 'shiyao': 1, 'yingyao': 4, 'fullname': '水雷屯', 'najia': ['庚子', '庚寅', '庚辰', '戊申', '戊戌', '戊子'], 'gong': '坎', 'gongwei': '二世'}, 
    '益': {'wuxing': WUXING.木, 'shiyao': 2, 'yingyao': 5, 'fullname': '风雷益', 'najia': ['庚子', '庚寅', '庚辰', '辛未', '辛巳', '辛卯'], 'gong': '巽', 'gongwei': '三世'}, 
    '震': {'wuxing': WUXING.木, 'shiyao': 5, 'yingyao': 2, 'fullname': '震为雷', 'najia': ['庚子', '庚寅', '庚辰', '庚午', '庚申', '庚戌'], 'gong': '震', 'gongwei': '本宫'}, 
    '噬嗑': {'wuxing': WUXING.木, 'shiyao': 4, 'yingyao': 1, 'fullname': '火雷噬嗑', 'najia': ['庚子', '庚寅', '庚辰', '己酉', '己未', '己巳'], 'gong': '巽', 'gongwei': '五世'}, 
    '随': {'wuxing': WUXING.木, 'shiyao': 2, 'yingyao': 5, 'fullname': '泽雷随', 'najia': ['庚子', '庚寅', '庚辰', '丁亥', '丁酉', '丁未'], 'gong': '震', 'gongwei': '归魂'}, 
    '无妄': {'wuxing': WUXING.木, 'shiyao': 3, 'yingyao': 0, 'fullname': '天雷无妄', 'najia': ['庚子', '庚寅', '庚辰', '壬午', '壬申', '壬戌'], 'gong': '巽', 'gongwei': '四世'}, 
    '明夷': {'wuxing': WUXING.水, 'shiyao': 3, 'yingyao': 0, 'fullname': '地火明夷', 'najia': ['己卯', '己丑', '己亥', '癸丑', '癸亥', '癸酉'], 'gong': '坎', 'gongwei': '游魂'}, 
    '贲': {'wuxing': WUXING.土, 'shiyao': 0, 'yingyao': 3, 'fullname': '山火贲', 'najia': ['己卯', '己丑', '己亥', '丙戌', '丙子', '丙寅'], 'gong': '艮', 'gongwei': '一世'}, 
    '既济': {'wuxing': WUXING.水, 'shiyao': 2, 'yingyao': 5, 'fullname': '水火既济', 'najia': ['己卯', '己丑', '己亥', '戊申', '戊戌', '戊子'], 'gong': '坎', 'gongwei': '三世'}, 
    '家人': {'wuxing': WUXING.木, 'shiyao': 1, 'yingyao': 4, 'fullname': '风火家人', 'najia': ['己卯', '己丑', '己亥', '辛未', '辛巳', '辛卯'], 'gong': '巽', 'gongwei': '二世'}, 
    '丰': {'wuxing': WUXING.水, 'shiyao': 4, 'yingyao': 1, 'fullname': '雷火丰', 'najia': ['己卯', '己丑', '己亥', '庚午', '庚申', '庚戌'], 'gong': '坎', 'gongwei': '五世'}, 
    '离': {'wuxing': WUXING.火, 'shiyao': 5, 'yingyao': 2, 'fullname': '离为火', 'najia': ['己卯', '己丑', '己亥', '己酉', '己未', '己巳'], 'gong': '离', 'gongwei': '本宫'}, 
    '革': {'wuxing': WUXING.水, 'shiyao': 3, 'yingyao': 0, 'fullname': '泽火革', 'najia': ['己卯', '己丑', '己亥', '丁亥', '丁酉', '丁未'], 'gong': '坎', 'gongwei': '四世'}, 
    '同人': {'wuxing': WUXING.火, 'shiyao': 2, 'yingyao': 5, 'fullname': '天火同人', 'najia': ['己卯', '己丑', '己亥', '壬午', '壬申', '壬戌'], 'gong': '离', 'gongwei': '归魂'}, 
    '临': {'wuxing': WUXING.土, 'shiyao': 1, 'yingyao': 4, 'fullname': '地泽临', 'najia': ['丁巳', '丁卯', '丁丑', '癸丑', '癸亥', '癸酉'], 'gong': '坤', 'gongwei': '二世'}, 
    '损': {'wuxing': WUXING.土, 'shiyao': 2, 'yingyao': 5, 'fullname': '山泽损', 'najia': ['丁巳', '丁卯', '丁丑', '丙戌', '丙子', '丙寅'], 'gong': '艮', 'gongwei': '三世'}, 
    '节': {'wuxing': WUXING.水, 'shiyao': 0, 'yingyao': 3, 'fullname': '水泽节', 'najia': ['丁巳', '丁卯', '丁丑', '戊申', '戊戌', '戊子'], 'gong': '坎', 'gongwei': '一世'}, 
    '中孚': {'wuxing': WUXING.土, 'shiyao': 3, 'yingyao': 0, 'fullname': '风泽中孚', 'najia': ['丁巳', '丁卯', '丁丑', '辛未', '辛巳', '辛卯'], 'gong': '艮', 'gongwei': '游魂'}, 
    '归妹': {'wuxing': WUXING.金, 'shiyao': 2, 'yingyao': 5, 'fullname': '雷泽归妹', 'najia': ['丁巳', '丁卯', '丁丑', '庚午', '庚申', '庚戌'], 'gong': '兑', 'gongwei': '归魂'}, 
    '睽': {'wuxing': WUXING.土, 'shiyao': 3, 'yingyao': 0, 'fullname': '火泽睽', 'najia': ['丁巳', '丁卯', '丁丑', '己酉', '己未', '己巳'], 'gong': '艮', 'gongwei': '四世'}, 
    '兑': {'wuxing': WUXING.金, 'shiyao': 5, 'yingyao': 2, 'fullname': '兑为泽', 'najia': ['丁巳', '丁卯', '丁丑', '丁亥', '丁酉', '丁未'], 'gong': '兑', 'gongwei': '本宫'}, 
    '履': {'wuxing': WUXING.土, 'shiyao': 4, 'yingyao': 1, 'fullname': '天泽履', 'najia': ['丁巳', '丁卯', '丁丑', '壬午', '壬申', '壬戌'], 'gong': '艮', 'gongwei': '五世'}, 
    '泰': {'wuxing': WUXING.土, 'shiyao': 2, 'yingyao': 5, 'fullname': '地天泰', 'najia': ['甲子', '甲寅', '甲辰', '癸丑', '癸亥', '癸酉'], 'gong': '坤', 'gongwei': '三世'}, 
    '大畜': {'wuxing': WUXING.土, 'shiyao': 1, 'yingyao': 4, 'fullname': '山天大畜', 'najia': ['甲子', '甲寅', '甲辰', '丙戌', '丙子', '丙寅'], 'gong': '艮', 'gongwei': '二世'}, 
    '需': {'wuxing': WUXING.土, 'shiyao': 3, 'yingyao': 0, 'fullname': '水天需', 'najia': ['甲子', '甲寅', '甲辰', '戊申', '戊戌', '戊子'], 'gong': '坤', 'gongwei': '游魂'}, 
    '小畜': {'wuxing': WUXING.木, 'shiyao': 0, 'yingyao': 3, 'fullname': '风天小畜', 'najia': ['甲子', '甲寅', '甲辰', '辛未', '辛巳', '辛卯'], 'gong': '巽', 'gongwei': '一世'}, 
    '大壮': {'wuxing': WUXING.土, 'shiyao': 3, 'yingyao': 0, 'fullname': '雷天大壮', 'najia': ['甲子', '甲寅', '甲辰', '庚午', '庚申', '庚戌'], 'gong': '坤', 'gongwei': '四世'}, 
    '大有': {'wuxing': WUXING.金, 'shiyao': 2, 'yingyao': 5, 'fullname': '火天大有', 'najia': ['甲子', '甲寅', '甲辰', '己酉', '己未', '己巳'], 'gong': '乾', 'gongwei': '归魂'}, 
    '夬': {'wuxing': WUXING.土, 'shiyao': 4, 'yingyao': 1, 'fullname': '泽天夬', 'najia': ['甲子', '甲寅', '甲辰', '丁亥', '丁酉', '丁未'], 'gong': '坤', 'gongwei': '五世'}, 
    '乾': {'wuxing': WUXING.金, 'shiyao': 5, 'yingyao': 2, 'fullname': '乾为天', 'najia': ['甲子', '甲寅', '甲辰', '壬午', '壬申', '壬戌'], 'gong': '乾', 'gongwei': '本宫'}
    }

XUNKONGDICT = {
    '甲子': ['戌', '亥'], '乙丑': ['戌', '亥'], '丙寅': ['戌', '亥'], '丁卯': ['戌', '亥'], '戊辰': ['戌', '亥'], '己巳': ['戌', '亥'], '庚午': ['戌', '亥'], '辛未': ['戌', '亥'], '壬申': ['戌', '亥'], '癸酉': ['戌', '亥'], 
    '甲戌': ['申', '酉'], '乙亥': ['申', '酉'], '丙子': ['申', '酉'], '丁丑': ['申', '酉'], '戊寅': ['申', '酉'], '己卯': ['申', '酉'], '庚辰': ['申', '酉'], '辛巳': ['申', '酉'], '壬午': ['申', '酉'], '癸未': ['申', '酉'], 
    '甲申': ['午', '未'], '乙酉': ['午', '未'], '丙戌': ['午', '未'], '丁亥': ['午', '未'], '戊子': ['午', '未'], '己丑': ['午', '未'], '庚寅': ['午', '未'], '辛卯': ['午', '未'], '壬辰': ['午', '未'], '癸巳': ['午', '未'], 
    '甲午': ['辰', '巳'], '乙未': ['辰', '巳'], '丙申': ['辰', '巳'], '丁酉': ['辰', '巳'], '戊戌': ['辰', '巳'], '己亥': ['辰', '巳'], '庚子': ['辰', '巳'], '辛丑': ['辰', '巳'], '壬寅': ['辰', '巳'], '癸卯': ['辰', '巳'], 
    '甲辰': ['寅', '卯'], '乙巳': ['寅', '卯'], '丙午': ['寅', '卯'], '丁未': ['寅', '卯'], '戊申': ['寅', '卯'], '己酉': ['寅', '卯'], '庚戌': ['寅', '卯'], '辛亥': ['寅', '卯'], '壬子': ['寅', '卯'], '癸丑': ['寅', '卯'], 
    '甲寅': ['子', '丑'], '乙卯': ['子', '丑'], '丙辰': ['子', '丑'], '丁巳': ['子', '丑'], '戊午': ['子', '丑'], '己未': ['子', '丑'], '庚申': ['子', '丑'], '辛酉': ['子', '丑'], '壬戌': ['子', '丑'], '癸亥': ['子', '丑']
    }

WXXQSPOWER = [1, 0.8, 0.2, 0.4, 0.6]

SWMJIDX = [1, 3, 3, 5, 7]
